In [1]:
import pandas as pd
import pandas as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([
[1,2,3,4],[3,4,2],[3,4,4,3]
])

In [5]:
df1

   0  1  2    3
0  1  2  3  4.0
1  3  4  2  NaN
2  3  4  4  3.0

In [6]:
print(df1)

   0  1  2    3
0  1  2  3  4.0
1  3  4  2  NaN
2  3  4  4  3.0

In [7]:
df1.head(3)

   0  1  2    3
0  1  2  3  4.0
1  3  4  2  NaN
2  3  4  4  3.0

In [8]:
df1.head(2)

   0  1  2    3
0  1  2  3  4.0
1  3  4  2  NaN

In [9]:
df1.tail(2)

   0  1  2    3
1  3  4  2  NaN
2  3  4  4  3.0

# Slicing of the dataframe

In [10]:
df1.shape

(3, 4)

In [11]:
df1.iloc[0,1]

2

In [12]:
df1.iloc[0:2,0:2]

   0  1
0  1  2
1  3  4

# Rename the column

In [13]:
df1 = pd.DataFrame([[1,2,3],[3,4,2],[4,5,3]],columns = ['A','B','C'])

In [14]:
df1

   A  B  C
0  1  2  3
1  3  4  2
2  4  5  3

# Reading the CSV files

In [15]:
df = pd.read_csv('data.csv',encoding='ISO-8859-1')

In [16]:
df

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37
...,...,...,...,...,...,...,...,...,...,...
94,96,"Linden® 12"" Wall Clock With Oak Frame",Doug Bickford,10535,-44.14,33.98,19.99,Northwest Territories,Office Furnishings,0.55
95,97,Newell 326,Doug Bickford,10535,-0.79,1.76,0.70,Northwest Territories,Pens & Art Supplies,0.56
96,98,Prismacolor Color Pencil Set,Jamie Kunitz,10789,76.42,19.84,4.10,Northwest Territories,Pens & Art Supplies,0.44
97,99,Xerox Blank Computer Paper,Anthony Johnson,10791,93.36,19.98,5.77,Northwest Territories,Paper,0.38
98,100,600 Series Flip,Ralph Knight,10945,4.22,95.99,8.99,Northwest Territories,Telephones and Communication,0.57

In [17]:
df.head()

,1,"Eldon Base for stackable storage shelf, platinum",Muhammed MacIntyre,3,-213.25,38.94,35,Nunavut,Storage & Organization,0.8
0,2,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Barry French,293,457.81,208.16,68.02,Nunavut,Appliances,0.58
1,3,"Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl",Barry French,293,46.71,8.69,2.99,Nunavut,Binders and Binder Accessories,0.39
2,4,R380,Clay Rozendal,483,1198.97,195.99,3.99,Nunavut,Telephones and Communication,0.58
3,5,Holmes HEPA Air Purifier,Carlos Soltero,515,30.94,21.78,5.94,Nunavut,Appliances,0.50
4,6,G.E. Longer-Life Indoor Recessed Floodlight Bulbs,Carlos Soltero,515,4.43,6.64,4.95,Nunavut,Office Furnishings,0.37

In [18]:
print(df['35'].dtype)

float64

In [19]:
print(df['Nunavut'].dtype)

object

In [20]:
print(df['Nunavut'])

0                   Nunavut
1                   Nunavut
2                   Nunavut
3                   Nunavut
4                   Nunavut
              ...
94    Northwest Territories
95    Northwest Territories
96    Northwest Territories
97    Northwest Territories
98    Northwest Territories
Name: Nunavut, Length: 99, dtype: object

In [21]:
print(df['35'].astype('category'))

0     68.02
1      2.99
2      3.99
3      5.94
4      4.95
      ...
94    19.99
95     0.70
96     4.10
97     5.77
98     8.99
Name: 35, Length: 99, dtype: category
Categories (73, float64): [0.49, 0.50, 0.70, 0.76, ..., 64.73, 68.02, 69.00, 74.35]

C:\Users\amarn\AppData\Local\Temp\ipykernel_22936\2973981338.py:1: FutureWarning: Index.ravel returning ndarray is deprecated; in a future version this will return a view on self.
  print(df['35'].astype('category'))

# writing to a CSV file

In [22]:
df = pd.DataFrame([[1,2,3],[3,4,3],[23,42,43]],columns = ['A','B','C'])

In [23]:
df

    A   B   C
0   1   2   3
1   3   4   3
2  23  42  43

In [24]:
df.to_csv('export.csv')

In [25]:
df.to_csv('export3.csv',index = False)

# Merging dataframes in python using pandas

In [34]:
df = pd.DataFrame([[1,2,3],[3,4,3],[23,42,43]],columns = ['A','B','C'])
df1 = pd.DataFrame([[11,22,33],[31,42,33],[23,42,43]],columns = ['X','Y','Z'])

In [35]:
df2  = pd.merge(df,df1,right_on='Y',left_on='B')

In [36]:
df2

    A   B   C   X   Y   Z
0  23  42  43  31  42  33
1  23  42  43  23  42  43

# Working with JSON

In [47]:
json_data = """{"a":1,
            "b":2,
            "c":3}"""

In [48]:
json_data

'{"a":1,\n            "b":2,\n            "c":3}'

In [49]:
import json

In [50]:
x = json.loads(json_data)

In [51]:
x

{'a': 1, 'b': 2, 'c': 3}

In [52]:
x['b']

2

In [53]:
with open ('new.json','w') as f:
    json.dump(x,f)